InformationRegisters/СостоянияСинхронизацииОбъектовСЦентромЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СостоянияСинхронизацииОбъектовСЦентромЭДО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МеткаВремени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСинхронизации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПопыток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЭДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипДанных</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСинхронизацииСЦентромЭДО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкиИнтеграцииЦентраЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиИнтеграцииЦентраЭДО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УчетнаяЗаписьЦентраЭДО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЦентровЭДО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребуетсяЗавершитьПереходВЦентрЭДО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЭДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыСинхронизацииСЦентромЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыСинхронизацииСЦентромЭДО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДокументыЭДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриглашенияЭДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УчетныеЗаписиЭДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДанныеДокументовЭДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтатусыДоверенностей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТранспортныеКонтейнерыЭДО</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/СостоянияСинхронизацииОбъектовСЦентромЭДО/Ext/ManagerModule.bsl
// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Параметры:
//  ТипДанных - ПеречислениеСсылка.ТипыСинхронизацииСЦентромЭДО
//  СостояниеСинхронизации - см. НовоеСостояниеОбъекта
Процедура ЗаписатьСостояние(ТипДанных, СостояниеСинхронизации) Экспорт
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИдентификаторЭДО.Установить(СостояниеСинхронизации.ИдентификаторЭДО);
	НаборЗаписей.Отбор.ТипДанных.Установить(ТипДанных);
	НаборЗаписей.Отбор.ИдентификаторОбъекта.Установить(СостояниеСинхронизации.ИдентификаторОбъекта);
	ЗаписьНабора = НаборЗаписей.Добавить();
	ЗаполнитьЗначенияСвойств(ЗаписьНабора, СостояниеСинхронизации);
	ЗаписьНабора.ТипДанных = ТипДанных;
	ЗаписьНабора.ДатаСинхронизации = ТекущаяДатаСеанса();
	НаборЗаписей.Записать();
КонецПроцедуры

// Параметры:
//  ТипДанных - ПеречислениеСсылка.ТипыСинхронизацииСЦентромЭДО
//  СостояниеСинхронизации - Структура:
//  * ИдентификаторОбъекта - Строка
//  * ИдентификаторЭДО - Строка
//  * МеткаВремени - Число
//  * Удаление - Булево
//  ОписаниеОшибки - Строка
Процедура ЗаписатьОшибку(ТипДанных, СостояниеСинхронизации, ОписаниеОшибки) Экспорт
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИдентификаторЭДО.Установить(СостояниеСинхронизации.ИдентификаторЭДО);
	НаборЗаписей.Отбор.ТипДанных.Установить(ТипДанных);
	НаборЗаписей.Отбор.ИдентификаторОбъекта.Установить(СостояниеСинхронизации.ИдентификаторОбъекта);
	НачатьТранзакцию();
	Попытка
		ОбщегоНазначенияБЭД.УстановитьУправляемуюБлокировкуПоНаборуЗаписей(НаборЗаписей);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() Тогда
			ЗаписьНабора = НаборЗаписей[0];
		Иначе
			ЗаписьНабора = НаборЗаписей.Добавить();
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(ЗаписьНабора, СостояниеСинхронизации);
		ЗаписьНабора.ТипДанных = ТипДанных;
		ЗаписьНабора.ДатаСинхронизации = ТекущаяДатаСеанса();
		ЗаписьНабора.Ошибка = Истина;
		ЗаписьНабора.ОписаниеОшибки = ОписаниеОшибки;
		ЗаписьНабора.КоличествоПопыток = ЗаписьНабора.КоличествоПопыток + 1;
		НаборЗаписей.Записать();
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
КонецПроцедуры

// Параметры:
//  ТипДанных - ПеречислениеСсылка.ТипыСинхронизацииСЦентромЭДО
//  ИдентификаторыЭДО - Массив из Строка
//  ПределПопыток - Число
//  Порция - Число
// 
// Возвращаемое значение:
//  Массив из Строка
Функция ОбъектыСОшибками(ТипДанных, ИдентификаторыЭДО, ПределПопыток = 4) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	СостоянияСинхронизацииОбъектовСЦентромЭДО.ИдентификаторОбъекта
		|ИЗ
		|	РегистрСведений.СостоянияСинхронизацииОбъектовСЦентромЭДО КАК СостоянияСинхронизацииОбъектовСЦентромЭДО
		|ГДЕ
		|	СостоянияСинхронизацииОбъектовСЦентромЭДО.ИдентификаторЭДО В (&ИдентификаторыЭДО)
		|	И СостоянияСинхронизацииОбъектовСЦентромЭДО.ТипДанных = &ТипДанных
		|	И СостоянияСинхронизацииОбъектовСЦентромЭДО.Ошибка
		|	И СостоянияСинхронизацииОбъектовСЦентромЭДО.КоличествоПопыток < &ПределПопыток";
	Запрос.УстановитьПараметр("ТипДанных", ТипДанных);
	Запрос.УстановитьПараметр("ИдентификаторыЭДО", ИдентификаторыЭДО);
	Запрос.УстановитьПараметр("ПределПопыток", ПределПопыток);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ИдентификаторОбъекта");
	
КонецФункции

// Возвращаемое значение:
//  Структура:
//  * ИдентификаторОбъекта - Строка
//  * ИдентификаторЭДО - Строка
//  * МеткаВремени - Число
//  * Удаление - Булево
Функция НовоеСостояниеОбъекта() Экспорт
	
	Состояние = Новый Структура;
	Состояние.Вставить("ИдентификаторОбъекта", "");
	Состояние.Вставить("ИдентификаторЭДО", "");
	Состояние.Вставить("МеткаВремени", 0);
	Состояние.Вставить("Удаление", Ложь);
	Возврат Состояние;
	
КонецФункции

// Параметры:
//  ТипДанных - ПеречислениеСсылка.ТипыСинхронизацииСЦентромЭДО
//  ИдентификаторыЭДО - Массив из Строка
// 
// Возвращаемое значение:
//  Массив из см. НовоеСостояниеОбъекта
Функция СостоянияОбъектовСОшибками(ТипДанных, ИдентификаторыЭДО) Экспорт
	
	ШаблонЗапроса =
		"ВЫБРАТЬ
		|	СостоянияСинхронизацииОбъектовСЦентромЭДО.ИдентификаторОбъекта КАК ИдентификаторОбъекта,
		|	СостоянияСинхронизацииОбъектовСЦентромЭДО.ИдентификаторЭДО КАК ИдентификаторЭДО,
		|	СостоянияСинхронизацииОбъектовСЦентромЭДО.МеткаВремени КАК МеткаВремени
		|ИЗ
		|	РегистрСведений.СостоянияСинхронизацииОбъектовСЦентромЭДО КАК СостоянияСинхронизацииОбъектовСЦентромЭДО
		|ГДЕ
		|	СостоянияСинхронизацииОбъектовСЦентромЭДО.ИдентификаторЭДО = &ИдентификаторЭДО
		|	И СостоянияСинхронизацииОбъектовСЦентромЭДО.ТипДанных = &ТипДанных
		|	И СостоянияСинхронизацииОбъектовСЦентромЭДО.Ошибка
		|	И СостоянияСинхронизацииОбъектовСЦентромЭДО.КоличествоПопыток < 4";
	
	Запрос = Новый Запрос;
	
	ШаблонПараметраИдентификаторЭДО = "&ИдентификаторЭДО";
	ТекстыПодзапроса = Новый Массив; // Массив из Строка
	Счетчик = 0;
	
	Для Каждого ИдентификаторЭДО Из ИдентификаторыЭДО Цикл
		
		Счетчик = Счетчик + 1;
		
		ПараметрИдентификаторЭДО = ШаблонПараметраИдентификаторЭДО + Счетчик;
		ТекстПодзапроса = СтрЗаменить(ШаблонЗапроса, ШаблонПараметраИдентификаторЭДО, ПараметрИдентификаторЭДО);
		ИмяПараметра = Сред(ПараметрИдентификаторЭДО, 2);
		Запрос.УстановитьПараметр(ИмяПараметра, ИдентификаторЭДО);
		
		ТекстыПодзапроса.Добавить(ТекстПодзапроса);
		
	КонецЦикла;
	
	Запрос.Текст = СтрСоединить(ТекстыПодзапроса, ОбщегоНазначения.ТекстОбъединитьВсе());
	Запрос.УстановитьПараметр("ТипДанных", ТипДанных);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	СостоянияОбъектов = Новый Массив; // См. СостоянияОбъектовСОшибками
	
	Пока Выборка.Следующий() Цикл
		СостояниеОбъекта = НовоеСостояниеОбъекта();
		ЗаполнитьЗначенияСвойств(СостояниеОбъекта, Выборка);
		СостоянияОбъектов.Добавить(СостояниеОбъекта);
	КонецЦикла;
	
	Возврат СостоянияОбъектов;
	
КонецФункции

// Параметры:
//  ТипДанных - ПеречислениеСсылка.ТипыСинхронизацииСЦентромЭДО
//  МеткиВремениОбъектов - Массив из Структура:
//  * ИдентификаторЭДО - Строка
//  * ИдентификаторОбъекта - Строка
//  * МеткаВремени - Число
// 
// Возвращаемое значение:
//  Массив из см. НовоеСостояниеОбъекта
Функция СостоянияОбъектовДляАктуализации(ТипДанных, МеткиВремениОбъектов) Экспорт
	
	ТаблицаМетокВремени = Новый ТаблицаЗначений;
	ТаблицаМетокВремени.Колонки.Добавить("ИдентификаторЭДО", ОбщегоНазначения.ОписаниеТипаСтрока(70));
	ТаблицаМетокВремени.Колонки.Добавить("ИдентификаторОбъекта", ОбщегоНазначения.ОписаниеТипаСтрока(50));
	ТаблицаМетокВремени.Колонки.Добавить("МеткаВремени", ОбщегоНазначения.ОписаниеТипаЧисло(15));
	
	Для Каждого МеткаВремениОбъекта Из МеткиВремениОбъектов Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаМетокВремени.Добавить(), МеткаВремениОбъекта);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаМетокВремени.ИдентификаторЭДО КАК ИдентификаторЭДО,
		|	ТаблицаМетокВремени.ИдентификаторОбъекта КАК ИдентификаторОбъекта,
		|	ТаблицаМетокВремени.МеткаВремени КАК МеткаВремени
		|ПОМЕСТИТЬ АктуальныеМеткиВремени
		|ИЗ
		|	&ТаблицаМетокВремени КАК ТаблицаМетокВремени
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ИдентификаторЭДО,
		|	ИдентификаторОбъекта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АктуальныеМеткиВремени.ИдентификаторЭДО КАК ИдентификаторЭДО,
		|	АктуальныеМеткиВремени.ИдентификаторОбъекта КАК ИдентификаторОбъекта,
		|	ЕСТЬNULL(СостоянияСинхронизации.МеткаВремени, 0) КАК МеткаВремени
		|ИЗ
		|	АктуальныеМеткиВремени КАК АктуальныеМеткиВремени
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияСинхронизацииОбъектовСЦентромЭДО КАК СостоянияСинхронизации
		|		ПО АктуальныеМеткиВремени.ИдентификаторЭДО = СостоянияСинхронизации.ИдентификаторЭДО
		|		И СостоянияСинхронизации.ТипДанных = &ТипДанных
		|		И АктуальныеМеткиВремени.ИдентификаторОбъекта = СостоянияСинхронизации.ИдентификаторОбъекта
		|ГДЕ
		|	АктуальныеМеткиВремени.МеткаВремени > ЕСТЬNULL(СостоянияСинхронизации.МеткаВремени, 0)";
	
	Запрос.УстановитьПараметр("ТаблицаМетокВремени", ТаблицаМетокВремени);
	Запрос.УстановитьПараметр("ТипДанных", ТипДанных);
	
	СостоянияОбъектов = Новый Массив; // См. СостоянияОбъектовДляАктуализации
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СостояниеОбъекта = НовоеСостояниеОбъекта();
		ЗаполнитьЗначенияСвойств(СостояниеОбъекта, Выборка);
		СостоянияОбъектов.Добавить(СостояниеОбъекта);
	КонецЦикла;
	
	Возврат СостоянияОбъектов;
	
КонецФункции

// Параметры:
//  ТипДанных - ПеречислениеСсылка.ТипыСинхронизацииСЦентромЭДО
//  СостояниеСинхронизации - см. НовоеСостояниеОбъекта
// 
// Возвращаемое значение:
//  Булево
Функция СостояниеОбъектаАктуально(ТипДанных, СостояниеСинхронизации) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СостоянияСинхронизацииОбъектовСЦентромЭДО.МеткаВремени КАК МеткаВремени
		|ИЗ
		|	РегистрСведений.СостоянияСинхронизацииОбъектовСЦентромЭДО КАК СостоянияСинхронизацииОбъектовСЦентромЭДО
		|ГДЕ
		|	СостоянияСинхронизацииОбъектовСЦентромЭДО.ИдентификаторЭДО = &ИдентификаторЭДО
		|	И СостоянияСинхронизацииОбъектовСЦентромЭДО.ТипДанных = &ТипДанных
		|	И СостоянияСинхронизацииОбъектовСЦентромЭДО.ИдентификаторОбъекта = &ИдентификаторОбъекта";
		
	Запрос.УстановитьПараметр("ИдентификаторЭДО", СостояниеСинхронизации.ИдентификаторЭДО);
	Запрос.УстановитьПараметр("ТипДанных", ТипДанных);
	Запрос.УстановитьПараметр("ИдентификаторОбъекта", СостояниеСинхронизации.ИдентификаторОбъекта);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат = СостояниеСинхронизации.МеткаВремени > Выборка.МеткаВремени;
	Иначе
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  ИдентификаторыОбъектов - Массив из Строка
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//  * Ключ - Строка
//  * Значение - Число
Функция МеткиВремениОбъектов(ИдентификаторыОбъектов) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СостоянияСинхронизацииОбъектовСЦентромЭДО.ИдентификаторОбъекта КАК ИдентификаторОбъекта,
		|	СостоянияСинхронизацииОбъектовСЦентромЭДО.МеткаВремени КАК МеткаВремени
		|ИЗ
		|	РегистрСведений.СостоянияСинхронизацииОбъектовСЦентромЭДО КАК СостоянияСинхронизацииОбъектовСЦентромЭДО
		|ГДЕ
		|	СостоянияСинхронизацииОбъектовСЦентромЭДО.ИдентификаторОбъекта В (&ИдентификаторыОбъектов)";
		
	Запрос.УстановитьПараметр("ИдентификаторыОбъектов", ИдентификаторыОбъектов);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат = Новый Соответствие;
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.ИдентификаторОбъекта, Выборка.МеткаВремени);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  ИдентификаторЭДО - Строка
//  ТипДанных - ПеречислениеСсылка.ТипыСинхронизацииСЦентромЭДО
//  ИдентификаторОбъекта - Строка
Процедура Удалить(ИдентификаторЭДО, ТипДанных, ИдентификаторОбъекта) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИдентификаторЭДО.Установить(ИдентификаторЭДО);
	НаборЗаписей.Отбор.ТипДанных.Установить(ТипДанных);
	НаборЗаписей.Отбор.ИдентификаторОбъекта.Установить(ИдентификаторОбъекта);
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Параметры:
//  ИдентификаторЭДО - Строка
//  ТипДанных - ПеречислениеСсылка.ТипыСинхронизацииСЦентромЭДО
//  ИдентификаторОбъекта - Строка
// 
// Возвращаемое значение:
//  См. НовоеСостояниеОбъекта
Функция СостояниеОбъекта(ИдентификаторЭДО, ТипДанных, ИдентификаторОбъекта) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СостоянияСинхронизацииОбъектовСЦентромЭДО.ИдентификаторЭДО КАК ИдентификаторЭДО,
		|	СостоянияСинхронизацииОбъектовСЦентромЭДО.ИдентификаторОбъекта КАК ИдентификаторОбъекта,
		|	СостоянияСинхронизацииОбъектовСЦентромЭДО.МеткаВремени КАК МеткаВремени
		|ИЗ
		|	РегистрСведений.СостоянияСинхронизацииОбъектовСЦентромЭДО КАК СостоянияСинхронизацииОбъектовСЦентромЭДО
		|ГДЕ
		|	СостоянияСинхронизацииОбъектовСЦентромЭДО.ИдентификаторЭДО = &ИдентификаторЭДО
		|	И СостоянияСинхронизацииОбъектовСЦентромЭДО.ТипДанных = &ТипДанных
		|	И СостоянияСинхронизацииОбъектовСЦентромЭДО.ИдентификаторОбъекта = &ИдентификаторОбъекта";
	
	Запрос.УстановитьПараметр("ИдентификаторЭДО", ИдентификаторЭДО);
	Запрос.УстановитьПараметр("ТипДанных", ТипДанных);
	Запрос.УстановитьПараметр("ИдентификаторОбъекта", ИдентификаторОбъекта);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СостояниеОбъекта = НовоеСостояниеОбъекта();
	СостояниеОбъекта.ИдентификаторЭДО = ИдентификаторЭДО;
	СостояниеОбъекта.ИдентификаторОбъекта = ИдентификаторОбъекта;
	
	Если Выборка.Следующий() Тогда
		СостояниеОбъекта.МеткаВремени = Выборка.МеткаВремени;
	КонецЕсли;
	
	Возврат СостояниеОбъекта;
	
КонецФункции

// Параметры:
//  ИдентификаторЭДО - Строка
//  ИдентификаторДокумента - Строка
// 
// Возвращаемое значение:
//  См. СостояниеОбъекта
Функция СостояниеДанныхДокумента(ИдентификаторЭДО, ИдентификаторДокумента) Экспорт
	
	Возврат СостояниеОбъекта(ИдентификаторЭДО,
		Перечисления.ТипыСинхронизацииСЦентромЭДО.ДанныеДокументовЭДО, ИдентификаторДокумента);
	
КонецФункции

// Параметры:
//  ОбъектыДляСинхронизации - Массив из РегистрСведенийКлючЗаписи.СостоянияСинхронизацииОбъектовСЦентромЭДО
// 
// Возвращаемое значение:
//  Структура:
//  * КонтекстДиагностики - см. ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики
Функция ПолучитьОбъектыИзСервиса(ОбъектыДляСинхронизации) Экспорт
	
	КонтекстДиагностики = ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики();
	
	Результат = Новый Структура;
	Результат.Вставить("КонтекстДиагностики", КонтекстДиагностики);
	
	//@skip-check invocation-parameter-type-intersect
	ИдентификаторыЭДО = ОбщегоНазначения.ВыгрузитьКолонку(ОбъектыДляСинхронизации, "ИдентификаторЭДО", Истина);
	УчетныеЗаписиПоИдентификаторамЭДО = РегистрыСведений.НастройкиИнтеграцииЦентраЭДО.УчетныеЗаписиПоИдентификаторамЭДО(
		ИдентификаторыЭДО);
	
	ВидОперации = НСтр("ru = 'Получение объектов из сервиса'");
	
	Для Каждого ОбъектДляСинхронизации Из ОбъектыДляСинхронизации Цикл
		
		ИдентификаторЭДО = ОбъектДляСинхронизации.ИдентификаторЭДО;
		УчетнаяЗаписьЦентраЭДО = УчетныеЗаписиПоИдентификаторамЭДО[ИдентификаторЭДО];
		Если УчетнаяЗаписьЦентраЭДО = Неопределено Тогда
			ИнтеграцияЦентраЭДО.ДобавитьНеизвестнуюОшибку(КонтекстДиагностики, ВидОперации,
				СтрШаблон(НСтр("ru = 'Не найдена учетная запись центра ЭДО для идентификатора ЭДО %1'"),
					ИдентификаторЭДО));
			Продолжить;
		КонецЕсли;
		
		ТипДанных = ОбъектДляСинхронизации.ТипДанных;
		ИдентификаторОбъекта = ОбъектДляСинхронизации.ИдентификаторОбъекта;
		СостояниеОбъекта = Неопределено;
		
		Если ТипДанных = Перечисления.ТипыСинхронизацииСЦентромЭДО.ДокументыЭДО Тогда
			ОписаниеМетода = ИнтеграцияЦентраЭДО.ОписаниеМетодаСервиса("ДанныеСинхронизацииДокументовЭДО",
				ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ИдентификаторОбъекта));
		ИначеЕсли ТипДанных = Перечисления.ТипыСинхронизацииСЦентромЭДО.ПриглашенияЭДО Тогда
			ОписаниеМетода = ИнтеграцияЦентраЭДО.ОписаниеМетодаСервиса("ДанныеСинхронизацииПриглашенийЭДО",
				ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ИдентификаторОбъекта));
		ИначеЕсли ТипДанных = Перечисления.ТипыСинхронизацииСЦентромЭДО.УчетныеЗаписиЭДО Тогда
			ОписаниеМетода = ИнтеграцияЦентраЭДО.ОписаниеМетодаСервиса("ДанныеСинхронизацииУчетныхЗаписейЭДО",
				ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ИдентификаторОбъекта));
		ИначеЕсли ТипДанных = Перечисления.ТипыСинхронизацииСЦентромЭДО.ДанныеДокументовЭДО Тогда
			СостояниеОбъекта = СостояниеОбъекта(ИдентификаторЭДО, ТипДанных, ИдентификаторОбъекта);
			ОписаниеМетода = ИнтеграцияЦентраЭДО.ОписаниеМетодаСервиса("ДанныеПолнойСинхронизацииДокументаЭДО",
				ИдентификаторОбъекта);
		Иначе
			ИнтеграцияЦентраЭДО.ДобавитьНеизвестнуюОшибку(КонтекстДиагностики, ВидОперации,
				СтрШаблон(НСтр("ru = 'Получение объектов типа ""%1"" не поддерживается'"), ТипДанных));
			Продолжить;
		КонецЕсли;
		
		ПараметрыВыполнения = ИнтеграцияЦентраЭДОПовтИсп.ПараметрыВыполненияМетодаСервиса(УчетнаяЗаписьЦентраЭДО);
		РезультатМетода = ИнтеграцияЦентраЭДО.ВыполнитьМетодСервиса(
			ПараметрыВыполнения, ОписаниеМетода, КонтекстДиагностики);
		Если РезультатМетода = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипДанных = Перечисления.ТипыСинхронизацииСЦентромЭДО.ДокументыЭДО Тогда
			ДанныеСинхронизацииДокументовЭДО = РезультатМетода; // См. ПрограммныйИнтерфейсЦентраЭДОВерсия3.ДанныеСинхронизацииДокументовЭДО
			ЭлектронныеДокументыЭДОИнтеграцияЦентраЭДО.ОбновитьДокументыЭДОПоДаннымСинхронизации(
				ДанныеСинхронизацииДокументовЭДО, КонтекстДиагностики);
		ИначеЕсли ТипДанных = Перечисления.ТипыСинхронизацииСЦентромЭДО.ПриглашенияЭДО Тогда
			ДанныеСинхронизацииПриглашенийЭДО = РезультатМетода; // См. ПрограммныйИнтерфейсЦентраЭДОВерсия3.ДанныеСинхронизацииПриглашенийЭДО
			ПриглашенияЭДОИнтеграцияЦентраЭДО.ОбновитьПриглашенияЭДОПоДаннымСинхронизации(
				ДанныеСинхронизацииПриглашенийЭДО, КонтекстДиагностики);
		ИначеЕсли ТипДанных = Перечисления.ТипыСинхронизацииСЦентромЭДО.УчетныеЗаписиЭДО Тогда
			ДанныеСинхронизацииУчетныхЗаписейЭДО = РезультатМетода; // См. ПрограммныйИнтерфейсЦентраЭДОВерсия3.ДанныеСинхронизацииУчетныхЗаписейЭДО
			ДанныеУчетныхЗаписейЭДО = УчетныеЗаписиЭДОИнтеграцияЦентраЭДО.ДанныеСинхронизацииУчетныхЗаписейЭДОИзФорматаСервиса(
				ДанныеСинхронизацииУчетныхЗаписейЭДО, УчетнаяЗаписьЦентраЭДО);
			УчетныеЗаписиЭДОИнтеграцияЦентраЭДО.ОбновитьУчетныеЗаписиЭДОПоДаннымСинхронизации(
				ДанныеУчетныхЗаписейЭДО, КонтекстДиагностики);
		ИначеЕсли ТипДанных = Перечисления.ТипыСинхронизацииСЦентромЭДО.ДанныеДокументовЭДО Тогда
			ДанныеПолнойСинхронизацииДокументаЭДО = РезультатМетода; // См. ПрограммныйИнтерфейсЦентраЭДОВерсия3.ДанныеПолнойСинхронизацииДокументаЭДО
			ЭлектронныйДокумент = ЭлектронныеДокументыЭДОИнтеграцияЦентраЭДО.ДокументПоИдентификаторуСервиса(
				ИдентификаторОбъекта);
			Если ЗначениеЗаполнено(ЭлектронныйДокумент) Тогда
				ЭлектронныеДокументыЭДОИнтеграцияЦентраЭДО.ЗагрузитьПолныеДанныеДокументаЭДО(
					ДанныеПолнойСинхронизацииДокументаЭДО, ЭлектронныйДокумент, СостояниеОбъекта,
					УчетнаяЗаписьЦентраЭДО);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
